[
  {
    "title": "迟来的 2020 年终总结",
    "date": "2021-03-31T00:24:02+08:00",
    "tags": [
      "2020",
      "年终总结",
      "工作",
      "生活"
    ],
    "category": "碎碎念",
    "content": "不知出于什么原因，前几个月对写博客这件事情始终提不起太多兴趣和动力，连一年一度的年终总结都鸽了三四个月。其实早在去年十二月底时，我就开始写年终总结了，可似乎总找不到写作的「感觉」——对着屏幕脑子一篇空白，好不容易琢磨了一个开头出来也不甚满意，后来便不了了之了。就当我以为这篇文章要一「鸽」到底时，最近居然找回了之前恨不得三天写一篇博客的状态，可眼看 2021 年都过了四分之一了，还写 2020 年的年终总结似乎有点说不过去…好在女朋友说：「没关系，上市公司的年度财报一般也都是次年的 3 月份发~」，我想了一下，觉得很有道理——于是便有了这篇姗姗来迟的年度总结。由于最近的几篇博客都是偏向技术方面的，所以本文则会更偏向生活方面的记录，技术可能仅会选择性的提一下。在武汉虽说我对奇安信有诸多不忿，但抛开工作上的事情不谈，那段时光我还挺怀念的——主要是怀念和同事们相处，一起在人均三十多的小餐馆里面吃饭、喝酒，苦中作乐。在 2019 年的最后一天，我照例和小伙伴们在公司附近的学校食堂里吃饭，我点了一份牛肉小火锅，在吃的时候我打开手机刷微博，刷到了「武汉出现不明原因肺炎」，当时也没当回事，只是和同事说了一下，提醒他注意点（因为他租的房子正好在江汉路），随后另一名同事说晚上想去江滩跨年并问我们去不去，我本身也不是一个喜欢热闹的人，加上刚刚看到的新闻，摇了摇头拒绝了。之后两周，疫情逐步「发酵」，新闻上隐有愈演愈烈之势，但也没有对现实生活产生多少影响，该上班还是得上。且由于当时我已有离职之心，想着年后回武汉便准备辞职，因此在离开武汉的前一天晚上还去江汉路找朋友吃饭，当时地铁上和商场里很少有人戴口罩，不过我因为比较惜命还是戴上了公司发的口罩（之后想想还真挺后怕）。之前文章里提过，我在积攒了不少调休，因此我在过年前一周就回家了，离开武汉的当天是工作日，一个在公司上班的同事偷溜出来送了我一下，我还挺感动的，可惜之后我们也没再见过了（不过现在也经常联系）。又重逢早在月初时，便和几个初中同学约好了一场聚会。等到聚会前夕时，疫情已经变得有些严重了，我爸妈都劝我别去，但我还是去了——所幸我去了，遇到了我初中时代暗恋的对象，现在的女朋友。再见她时，觉得她依旧那么有气质，而我的心境仿佛过了快十年都没什么长进——与她不经意见间的眼神交流都会让我紧张。饭局开始，自然而然地聊起了各自的近况，聊到她时，她似乎有些局促，说她毕业后就一直在家待着申请国外的研究生，是从大三开始就有的想法，因此放弃了保研的资格。顺着聊到选择研究生的方向时，话题不可避免的转向了我——她想从事数据分析方面的工作，最近在上 Coursera 上的机器学习课程，而我恰好对这方面比较擅长，于是我说我之前正好上过这门课，「喔～～」饭桌上响起大家心照不宣的声音——就好像初中时那样。是的，即使我对初中时期的大多数事情已经淡忘，但和她有关的事情却记得很清晰。当时，我喜欢她这件事不知怎么就传遍了班上，以至于同学们总喜欢起哄——提到她时，总会有人小声说一句我的名字，接着便是哄堂大笑，我总会红着脸不说话，内心却有些欣喜。好在她是一个不怎么在乎这些「流言」的人，反而会经常问我数学题，而其他人看到她问我数学题时，便会说一句：「哦～又来问数学题了呀」，而她置若罔闻，待我解释完之后才面不红心不跳的回到座位上。当时的我挺希望有更多同学起哄，就好像起哄的人多了就能帮我说出我心里不敢对她说的话一样。之后的事情我在高中篇回忆里有提到一些，中考结束时，我没有考上省重点，于是爸妈便想着参加并通过暑假夏令营考核的方式来进入这所中学，巧的是她与我被分到了同一个班里面，似乎她也是因为中考发挥失常。当时的我情绪有些低落，即使因为数学比较好能进入夏令营，在结营考试时却因为英语拖了后腿，无缘进入这个班级。在那之后，我在普通班里看着她在快班里成绩越来越好，而我只能在一本线外徘徊，虽然很不想承认，但我和她之间的应当是越来越远了。高考结束时，她是她们班上的第一名，登上了我们学校的报纸，我犹豫再三，仍是点开了她的对话框，将她上报纸的版面拍了一张照片发给了她，想象中的热烈情绪并没有出现——毕竟我和她已经三年没有说过话了，心里默叹一口气，还是把这份感情埋在心底吧。饭局结束后，我主动加上了她的微信，而几年前压抑在心中的感情突然有些蠢蠢欲动了，但我还是忍住了没有说出口，给她发送了一个课程的链接并告知有问题我可以随时解答后，我们结束了这场对话。在随后的三四天里我过得很煎熬，很想问她是否有在看我发给她的课程链接，如果看了的话是否遇到了什么问题？可又怕她觉得唐突。就这样到了第五天，她终于发过来了一个问题，有关逻辑回归的，具体问题我已经记不太清楚了，借此机会我和她聊了一下午，尽兴收场。随后几天，我们每天都会聊，虽然话题总是离不开学习，但能明显感觉和她之间的距离拉近了不少。之后我们的关系一直稳中有升，直到我准备提离职的那一天晚上。辞职时前文有提到过，我原本计划是在年后就直接辞职的（毕竟过年 7 天不上班还有工资拿），但因为疫情影响，以及公司随后宣布进行为期最少两周的在家办公让我决定暂时观望一下，想来不用去公司应该会轻松一些。后来的事实证明我真是太 Naive 了，也把我 Leader 想得太善良了——节后工作的第一天我们就开会开到了晚上 11 点，「办公室工作只是 996，远程工作就变成了 007」这话一点不假。随后几天公司各种奇葩规定仿佛在秀下限，日报还不算什么，甚至要求「小时报」，我对公司积攒的怒气值也终于在那天达到了顶峰。那天上午，Leader 忽然对我说，下午有一个会（是和我之前去上海出差的项目相关的）由我来主持，于是我从下午五点开始开会，一直开到了晚上八点，而且我作为负责人一直在讲话自然是没有机会吃饭的。会议结束后，我走出了房门，和家人坦白了我今天就要辞职的决定，~耶稣也拦不住我，~他们见我态度坚决，也没有多说什么。那晚由于我在写辞职信，所以顾不上和她聊天，写完辞职信时，已经是十点半了，我迫不及待的点开了她的聊天框，给她看了看我的辞职信——后来才知道那天她一直在等我找她聊天。在发给她看之后，我心里突然有些小忐忑：我担心她会像我其他的朋友一样不认同我的决定，而是希望我多忍一会 blabla 的，等到时机成熟一点、或者找到了下家之后再辞职；所幸刚说完我的决定之后，她就称赞我在这件事情上的果断，当时我特别开心能得到喜欢的人的理解和支持。于是乎，3 月 6 号那天晚上，借着徐佳莹的歌词，我表白成功了——那天晚上我激动得没怎么睡着。修养中离职之后的那段日子，我在这篇博客写的比较详尽，感兴趣的小伙伴可以移步观看，我就紧接着离职的两个月之后讲吧。找工作辞职后的两个月里没少被家里人数落：哎呀，你怎么还不去找工作啊；总在家待着怎么行啊，你不知道空闲时间越久就越找不到工作啊（还好有女朋友一直在身边鼓励我）……总之，无论是处于父母的唠叨还是我自己本身的计划，六月初的时候，我开始步入找工作的阶段了。首先是在 BOSS 直聘找了两家中型公司投了一下，结果都是已读未回，在这之后我就干脆放弃了招聘软件这条路，开始转向官网投递。官网投递的公司包括了之前对工作氛围我很认可并向往的豆瓣；以及工作理念我很看好的 LeanCloud。可能由于许久没面试，又是特别重视的公司导致有些紧张：豆瓣一面的几个问题答得都不是很好（稍复杂一点的数据库设计我真是一团糟），而 LeanCloud 则是因为技术栈的问题，投递简历后虽然得到了回复说我潜力很大（大概类似「好人卡」之类，拒绝你总要找个好一点的理由），但没有后续面试的机会。于是我又开始在 V2EX 上的招聘板块寻找帖子投递简历，先开始找的是一个比较小的初创公司（墨刀），一下午的时间就通过了两面，面试其实也就是和前后端的负责人分别聊聊天，过程还是挺愉快的，但是聊到福利环节的时候，因为公积金等缴纳基数只有 5000，所以即使技术栈我很感兴趣（Ruby）、交流也很愉快，在考虑良久之后还是选择拒绝了。找工作时，我特意避开了知名的大公司，因为来自上一家公司的阴影——我不想加班了，而据我在脉脉上的观察，大公司加班都很严重。而在找工作开始过去了快两周时间，两周时间说短不短说长也不长，但给我造成的压力已经有一些大了，心里的信念也有一些动摇。原来在遭到挫折之后，自我认知真的会不断的降低：会怀疑是否错估了自己的能力、最初的理念是否有失偏颇等等。而如果一个人在每次遭遇了挫折之后就开始不断的怀疑、调整自己的信念，我也不清楚最后他会变成什么样子，可我不想这样——「你尽可以消灭他，可就是打不败他」。就这样，我抱着十分矛盾的心理，讲我的遭遇告知了一位在博客圈「结识」的长者，并试图从他这里得到一些人生经验。其实发完之后我有些忐忑，毕竟我和他素未谋面，说是「结识」，其实仅仅是博客加了友链、Github 互 Follow 了而已。因此在仅几个小时，就收到了他长达三千多字的回复时，我感动得不成样子。而我也意识到了之前想法有些 Naive，事情并没有我想象的这么严重，都是我太钻牛角尖罢了。在这之后就是现在的公司了，也是在 V2EX 上翻到的招聘贴，不过录取的经历却颇有些一波三折：一面发挥不是特别好，有几个偏底层的问题没有回答上来，其中有的是因为没有 GET 到面试官的点，有的是因为确实不会；所以之后几天得到的回复是没有通过面试，谁知过了两周之后面试官又说没有找到更合适的了，想问问我愿不愿意继续后面的流程……于是，在八月初时，终于结束了在家待业四个多月的日子，开始了一段新的旅程。入职后之前几个章节都是在描写生活方面，本节就稍稍往技术上扯回一点吧～还是按照时间顺序聊吧，首先说说 GraphQL。我认为 GraphQL 就像是 ElasticSearch 一样，公司级别的产品会选择深入使用或者集成，因为它对于越大、越复杂的数据结构就越有优势，但是对于个人开发者而言，甚至都不会想到拓展这方面的技能；GraphQL 最大的优点就在于它对于复杂的数据结构非常具有表现力优势，比如图系统（从名字也可以看出），因为它可以非常方便的处理嵌套多层的数据，只需要编写对应的 Resolver（或者干脆配合 DataLoader 使用），各种嵌套字段的会由 GraphQL 自动寻找对应的 Resolver，然后解析数据再塞到 JSON 里。在熟悉了 GraphQL 之后，紧接着就是试图将图系统的同步 API 改写成异步 API（本文有详细的描述），这一过程极大加深了我对异步以及 Python 的历史包袱的认识。以及在异步 HTTP 客户端调用同步 API 服务器时，大概率是会出现问题的——异步 IO 里一个进程同时监听了多个 fd，每个 fd 都对应了一个发送的请求，而同步服务器只能一个一个的处理这些请求，所以请求多了，要么把客户端本机的 fd 都用完了，报   的错误，要么是服务器处理不过来了，只能选择舍弃掉一些连接，这时就会报连接失败的错误，所以及时关闭连接很重要。随后就是设计了一套用户登录的系统，主要是认证的设计，使用了 Refresh + JWT 双 Token 的设计，让 Refresh Token 弥补了 JWT 无状态的缺点（这篇文章真的写的非常好）。书影音按道理来说，今年在家休息了四个多月，电影和书籍应该看了不少才对，可恰恰相反，可能是因为在家时有着找工作的压力，虽然有着完整的时间，但却没有什么观影的心情；而在找到工作之后又正好反过来了，有观影的心情却只剩下了碎片化的时间。好在我也已经看开了，不再去追求什么一周看一本书、两部电影之类的目标了。不过也简单总结一下吧，剧集方面：之前看过《黑袍纠察队 1》，很喜欢，所以对《黑袍纠察队 2》的喜爱自然是水到渠成的（只要续集不是太烂，我都会很喜欢看）；《想见你》则是我第一次与女朋友一起看的爱情剧，虽然是爱情剧，但是里面的情节引人入胜程度丝毫不逊色于悬疑片、《王国 2》同样是包含了一部分《王国 1》的偏好，加上僵尸、宫斗题材我非常喜欢；动漫最喜爱的是《异度侵入》，我和女朋友从下午开始一直看到了凌晨，欲罢不能～；而电影方面，因为我想寻求感官上的刺激，所以恐怖电影看得比较多，反而没什么特别印象深刻的。书籍方面，虽然只看了寥寥 4 本书，还都是技术方面的（在家待业时真的很难静下心来阅读文学类书籍），但是有一点我很满意的是看完了两本英文的书籍——《Elixir in Actions》（让我入门了 Elixir 语言）、《Kubernetes in Actions》（对 K8s 的理解加深了），总算完成了很久以来的梦想，不过可能是因为《in actions》系列的书写的比较通俗易懂，像《Algorithm, 4th Edition》我尝试了数次还是一页都看不下去。。如果让用一个词来总结我的 2020 的话，我想应该是「幸运」。很幸运在从奇安信离职前交到了几个可以成为好朋友的人；很幸运重逢了少年时期的暗恋对象并成为了我的女朋友；很幸运在自我怀疑时有「长者」传授了人生经验；很幸运找到了一份非常喜欢的工作……还有许多，就不一一列举了。很幸运，很幸运让我遇到了你们。",
    "url": "/posts/summary-of-2020/"
  }
]